app/controllers/guests_controller.rb

  def index
    @guests = Guest.all
---
SELECT "guests".* FROM "guests"

  def create
    @guest = Guest.new(guest_params)

    respond_to do |format|
      if @guest.save
---
INSERT INTO "guests" ("First_name", "Last_Name", "Email", "Phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @guest.update(guest_params)
---
UPDATE "guests" SET "Email" = $1, "updated_at" = $2 WHERE "guests"."id" = $3  [["Email", "ali@gmail.com"], ["updated_at", "2021-04-02 06:28:52.509781"], ["id", 2]]

  def destroy
    @guest.destroy
---
DELETE FROM "guests" WHERE "guests"."id" = $1  [["id", 2]]

    def set_guest
      @guest = Guest.find(params[:id])
---
SELECT "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]